class FormList {
  static const List<String> divisions = [
    'ВО (очное)',
    'СПО',
    'Магистратура (Очное)',
    'Аспирантура',
    'ПО (подготовительное отделение)',
  ];
  static const List<String> institute1 = [
    'Гуманитарный институт',
    'Институт медицинского образования',
    'Институт цифровой экономики, управления и сервиса',
    'Политехнический институт',
    'Институт биотехнологий и химического инжиниринга',
    'Институт электронных и информационных систем',
    'Институт непрерывного педагогического образования',
    'Юридический институт',
  ];

  static const List<String> institute2 = [
    'Политехнический колледж',
    'Медицинский колледж',
    'Институт цифровой экономики, управления и сервиса',
    'Институт непрерывного педагогического образования',
    'Юридический институт',
  ];
  static const List<String> institute3 = [
    'Гуманитарный институт',
    'Институт непрерывного педагогического образования',
    'Институт цифровой экономики, управления и сервиса',
    'Институт электронных и информационных систем',
    'Политехнический институт',
    'Юридический институт',
  ];

  static const List<String> directions1 = [
    '42.03.02 Журналистика (Медиа в цифровом обществе, Продюсирование в медиа)',
    '45.03.01 Филология (Преподавание филологических дисциплин)',
    '45.03.02 Лингвистика (Перевод и переводоведение)',
    '46.03.01 История (История России и археология)',
  ];

  static const List<String> directions2 = [
    '31.05.01 Лечебное дело',
    '31.05.02 Педиатрия',
    '31.05.03 Стоматология',
    '33.05.01 Фармация',
    '34.03.01 Сестринское дело',
  ];

  static const List<String> directions3 = [
    '38.03.01 Экономика',
    '38.03.02 Менеджмент',
    '38.03.03 Управление персоналом',
    '43.03.02 Туризм',
  ];

  static const List<String> directions4 = [
    '07.03.01 Архитектура',
    '07.03.03 Дизайн архитектурной среды',
    '08.03.01 Строительство',
    '13.00.00 Электро- и теплоэнергетика',
    '15.03.00 Машиностроение',
    '23.03.03 Эксплуатация транспортно-технологических машин и комплексов',
    '29.03.04 Технология художественной обработки материалов',
  ];

  static const List<String> directions5 = [
    '04.05.01 Фундаментальная и прикладная химия',
    '05.03.02 География',
    '06.03.01 Биология',
    '21.03.02 Землеустройство и кадастры',
    '35.03.01 Лесное дело',
    '35.03.04 Агрономия',
    '35.03.06 Агроинженерия',
    '35.03.07 Технология производства и переработки с/х продукции',
    '36.03.02 Зоотехния',
  ];
  static const List<String> directions6 = [
    '01.03.02 Прикладная математика и информатика',
    '09.03.01 Информатика и вычислительная техника',
    '11.03.01 Радиотехника',
    '11.03.03 Конструирование и технология электронных средств',
    '11.03.04 Электроника и наноэлектроника',
  ];
  static const List<String> directions7 = [
    '37.03.01 Психология (профили: Психология, Психологическая помощь с использованием дистанционных технологий)',
    '44.03.01 Педагогическое образование (профиль Физическая культура)',
    '44.03.01 Педагогическое образование (Теология и традиционные ценности в системе воспитания)',
    '44.03.01 Педагогическое образование (профиль Дошкольное образование) ',
    '44.03.03 Специальное (дефектологическое) образование (профиль Логопедия)',
    '44.03.05 Педагогическое образование с двумя профилями подготовки (Физика и информатика)',
    '44.03.05 Педагогическое образование с двумя профилями подготовки (Математика и информатика)',
    '44.03.05 Педагогическое образование с двумя профилями (Биология и география)',
    '44.03.05 Педагогическое образование с двумя профилями (Русский язык и литература)',
    '44.03.05 Педагогическое образование с двумя профилями (Игропедагогика и английский язык)',
    '44.03.05 Педагогическое образование с двумя профилями (Изобразительное искусство и дополнительное образование: декоративно-прикладное искусство',
    '44.03.05 Педагогическое образование с двумя профилями (Менеджмент воспитания и социальная педагогика)',
    '44.03.05 Педагогическое образование с двумя профилями (Начальное образование и дополнительное образование: внеурочная работа)',
    '44.03.05 Педагогическое образование с двумя профилями (Технология и информатика)',
    '44.03.05 Педагогическое образование с двумя профилями подготовки (История и обществознание)',
    '44.03.05 Педагогическое образование с двумя профилями подготовки (Культурологическое образование и организация социально-культурной деятельности)',
    '44.03.05  Педагогическое образование с двумя профилями (Английский язык и немецкий язык / Немецкий язык и английский язык)',
  ];
  static const List<String> directions8 = [
    '40.03.01 Юриспруденция',
  ];

  static const List<String> directions2_1 = [
    '9.02.01 Компьютерные системы и комплексы',
    '09.02.06 Сетевое и системное администрирование',
    '09.02.07 Информационные системы и программирование',
    '15.02.14 Оснащение средствами автоматизации технологических процессов и производств',
    '15.02.16 Технология машиностроения',
    '23.02.07 Техническое обслуживание и ремонт двигателей, систем и агрегатов автомобилей',
    '54.02.01 Дизайн ',
    '54.01.20 Графический дизайнер',
  ];

  static const List<String> directions2_2 = [
    '31.02.01 Лечебное дело',
    '31.02.05 Стоматология ортопедическа',
    '34.02.01 Сестринское дело',
  ];

  static const List<String> directions2_3 = [
    '38.02.01 Экономика и бухгалтерский учет',
    '38.02.07 Банковское дело',
    '43.02.16 Туризм и гостеприимство',
  ];

  static const List<String> directions2_4 = [
    '44.02.01 Дошкольное образование',
    '44.02.02 Преподавание в начальных классах',
  ];

  static const List<String> directions2_5 = [
    '0.02.04 Юриспруденция',
  ];

  static const List<String> directions3_1 = [
    '42.04.02 Журналистика (Современная медиасфера)',
    '45.04.01 Филология (Русский язык и литература)',
    '46.04.01 История (Отечественная история; Международные отношения: Балтийский регион в пространстве истории и культуры)',
    '47.04.01 Философия (Идеология национальной безопасности)',
    '51.04.01 Культурология (Современные технологии изучения и сохранения объектов культурного наследия)',
    '51.04.01 Культурология (Гуманитарная урбанистика)',
  ];

  static const List<String> directions3_2 = [
    '37.04.01 Психология (Социальная психология развития)',
    '44.04.01 Педагогическое образование (Образовательный менеджмент)',
    '44.04.01 Педагогическое образование (Менеджмент и цифровизация образования)',
    '44.04.01 Педагогическое образование (Образование в области физической культуры и спорта)',
    '44.04.01 Педагогическое образование (Православная культура в современном образовании)',
    '44.04.01 Педагогическое образование (Образовательная урбанистика)',
  ];

  static const List<String> directions3_3 = [
    '38.04.02 Менеджмент (Финансовый менеджмент; Управление проектами национальной технологической инициативы; Цифровой маркетинг )',
    '38.04.03 Управление персоналом (Инновационные технологии управления персоналом организации)',
  ];

  static const List<String> directions3_4 = [
    '01.04.02 Прикладная математика и информатика (Прикладной анализ данных)',
    '09.04.01 Информатика и вычислительная техника (Искусственный интеллект)',
    '11.04.01 Радиотехника (Локация объектов и сред; Системы и устройства передачи, приема и обработки сигналов)',
    '11.04.03 Конструирование и технология электронных средств (Микроэлектроника и техника сверхвысоких частот)',
    '11.04.04 Электроника и наноэлектроника (Микро- и наноэлектронные устройства)',
  ];

  static const List<String> directions3_5 = [
    '08.04.01 Строительство (BIM: Технологии информационного моделирования в строительстве)',
    '15.04.05 Конструкторско-технологическое обеспечение машиностроительных производств (Технология машиностроения)',
  ];

  static const List<String> directions3_6 = [
    '27.04.08 Управление интеллектуальной собственностью (Организация, управление и правовое регулирование гражданского оборота интеллектуальной собственности)',
  ];

  static const List<String> aspirantura = [
    '1.2.2 Математическое моделирование, численные методы и комплексы программ',
    '1.3.4 Радиофизика',
    '1.3.8 Физика конденсированного состояния',
    '1.5.4 Биохимия',
    '2.2.2 Электронная компонентная база микро- и наноэлектроники, квантовых устройств',
    '2.2.13 Радиотехника, в том числе системы и устройства телевидения',
    '2.3.5 Математическое и программное обеспечение вычислительных систем, комплексов и компьютерных сетей',
    '2.5.5 Технология и оборудование механической и физико-технической обработки',
    '3.1.4 Акушерство и гинекология',
    '3.1.7 Стоматология',
    '3.1.9 Хирургия',
    '3.1.18 Внутренние болезни',
    '3.1.22 Инфекционные болезни',
    '5.1.1 Теоретико-исторические правовые науки',
    '5.1.4 Уголовно-правовые науки',
    '5.2.3 Региональная и отраслевая экономика',
    '5.2.6 Менеджмент',
    '5.6.1 Отечественная история',
    '5.6.2 Всеобщая история',
    '5.7.7 Социальная и политическая философия',
    '5.8.1 Общая педагогика, история педагогики и образования',
    '5.8.7 Методология и технология профессионального образования',
    '5.9.1 Русская литература и литературы народов Российской Федерации',
    '5.9.5 Русский язык. Языки народов России',
    '5.9.9 Медиакоммуникации и журналистика',
    '5.10.1 Теория и история культуры, искусства',
  ];

  static const Map<String, List<String>> instituteOptions = {
    '': [],
    'ВО (очное)': institute1,
    'СПО': institute2,
    'Магистратура (Очное)': institute3,
    'Аспирантура (Очное)': [],
    'ПО (подготовительное отделение)': []
    // Добавьте другие списки для других элементов
  };

  static const Map<String, Map<String, List<String>>> directionsMap = {
    'ВО (очное)': {
      'Гуманитарный институт': directions1,
      'Институт медицинского образования': directions2,
      'Институт цифровой экономики, управления и сервиса': directions3,
      'Политехнический институт': directions4,
      'Институт биотехнологий и химического инжиниринга': directions5,
      'Институт электронных и информационных систем': directions6,
      'Институт непрерывного педагогического образования': directions7,
      'Юридический институт': directions8,
    },
    'СПО': {
      'Политехнический колледж': directions2_1,
      'Медицинский колледж': directions2_2,
      'Институт цифровой экономики, управления и сервиса': directions2_3,
      'Институт непрерывного педагогического образования': directions2_4,
      'Юридический институт': directions2_5,
    },
    'Магистратура (Очное)': {
      'Гуманитарный институт': directions3_1,
      'Институт непрерывного педагогического образования': directions3_2,
      'Институт цифровой экономики, управления и сервиса': directions3_3,
      'Институт электронных и информационных систем': directions3_4,
      'Политехнический институт': directions3_5,
      'Юридический институт': directions3_6,
    },
    'Аспирантура': {'': aspirantura},
    'ПО (подготовительное отделение)': {'': []},
    // ... другие подразделения
  };

  static List<String> getInstitutes(String division) {
    return instituteOptions[division] ?? [];
  }
  static List<String> getDirections(String division, String institute) {
    print('$division, $institute');
    Map<String, List<String>>? instituteDirections = directionsMap[division];
    if (instituteDirections != null && instituteDirections.containsKey(institute)) {
      return instituteDirections[institute]!;
    }
    return [];
  }

}
